/* task 1 - version 1 - ok */
select "Н_ОЦЕНКИ"."КОД", "Н_ВЕДОМОСТИ"."ДАТА" from "Н_ОЦЕНКИ" inner join "Н_ВЕДОМОСТИ"
    on "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
    where "Н_ОЦЕНКИ"."КОД" = '3' and "Н_ВЕДОМОСТИ"."ИД" > 1250972;


/* task 2 - version 1 - ok */
select "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."ИД" from "Н_ЛЮДИ" left join "Н_ОБУЧЕНИЯ"
    on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    left join "Н_УЧЕНИКИ" using ("ЧЛВК_ИД", "ВИД_ОБУЧ_ИД")
    where "Н_ЛЮДИ"."ФАМИЛИЯ" = 'Афанасьев' and "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" < 113409 and "Н_УЧЕНИКИ"."ИД" > 100410;

/* task 3 - version 1 - ok */
select count("Н_ЛЮДИ"."ОТЧЕСТВО") from "Н_ЛЮДИ"
    inner join "Н_УЧЕНИКИ"
    on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    inner join "Н_ПЛАНЫ"
    on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    inner join "Н_ФОРМЫ_ОБУЧЕНИЯ"
    on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
    where "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'
    and "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" < '1997-01-15 00:00:00.000000'
    and "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > '2022-01-15 00:00:00.000000';

/* task 4 - version 1  */
select "ГРУППА" from "Н_ОТДЕЛЫ" НО
    inner join "Н_ПЛАНЫ" НП
        on НО."ИД" = НП."ОТД_ИД"
    inner join "Н_УЧЕНИКИ" НЧ
        on НП."ПЛАН_ИД" = НЧ."ПЛАН_ИД"
    where НЧ."НАЧАЛО" BETWEEN '2011-01-01'
        AND '2011-12-31'
       or НЧ."КОНЕЦ" BETWEEN '2011-01-01'
           AND '2011-12-31'
        and "ОТД_ИД_ЗАКРЕПЛЕН_ЗА" in (select "Н_ОТДЕЛЫ"."ИД" from "Н_ОТДЕЛЫ" where "ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники')
    group by "ГРУППА"
    having count("ГРУППА") < 10;

/* task 5 - скорее всего - надо еще разобраться как работает*/
select "ГРУППА", round(avg(EXTRACT(year FROM age(current_date, "ДАТА_РОЖДЕНИЯ")))) as "СРЕДНИЙ_ВОЗРАСТ"
    from "Н_УЧЕНИКИ" inner join "Н_ЛЮДИ"
        on ("Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД")
        group by "ГРУППА"
        having avg(EXTRACT(year FROM age(current_date, "ДАТА_РОЖДЕНИЯ"))) < (select  round(avg(EXTRACT(year FROM age(current_date,"ДАТА_РОЖДЕНИЯ")) :: int)) as age
        from "Н_ЛЮДИ" where "ИД" in (select "ЧЛВК_ИД" from "Н_УЧЕНИКИ" where "ГРУППА" = '1100'));

/* task 6 - скорее всего верно, нужно разобраться, псевдонимы чек*/
select "ГРУППА", "ЧЛВК_ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", "В_СВЯЗИ_С", "СОСТОЯНИЕ"
    from "Н_ЛЮДИ" inner join "Н_УЧЕНИКИ"
        on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД" inner join "Н_ПЛАНЫ"
        on "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД" inner join "Н_ФОРМЫ_ОБУЧЕНИЯ" НФО
        on "Н_ПЛАНЫ"."ФО_ИД" = НФО."ИД"
    where ("КУРС" = 1)
      and ("НАЧАЛО" < '2012-09-01'::timestamp)
      and ("НАИМЕНОВАНИЕ" = 'Заочная' or "НАИМЕНОВАНИЕ" = 'Очная')
      and exists (select "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НАПС_ИД"
      from "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" inner join "Н_НАПР_СПЕЦ" ННС
          on "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = ННС."ИД"
      where ННС."НАИМЕНОВАНИЕ" = 'Программная инженерия'
        and "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НАПС_ИД" = "Н_ПЛАНЫ"."НАПС_ИД");

/*
task 7
Вывести список людей, не являющихся или не являвшихся
студентами ФКТИУ (данные, о которых отсутствуют в таблице Н_УЧЕНИКИ).
В запросе нельзя использовать DISTINCT.
*/
select НЛ.* from "Н_ЛЮДИ" as НЛ where not НЛ."ИД" in (select НУ."ЧЛВК_ИД" from "Н_УЧЕНИКИ" as НУ);

